Revit 2026 API

# ElectricalSystemApparentCurrentPhaseC Property

---

The ApparentCurrentPhaseC value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentCurrentPhaseC { get; }
```
```vb
Public ReadOnly Property ApparentCurrentPhaseC As Double
	Get
```
```cpp
public:
property double ApparentCurrentPhaseC {
	double get ();
}
```
```fsharp
member ApparentCurrentPhaseC : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentCurrentPhaseC value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace